name: "seamlessm4t-large-v2"
backend: "python"

input [
  {
    name: "INPUT"
    data_type: TYPE_STRING
    dims: [1]
  }
]
output [
  {
    name": "OUTPUT"
    date_type: TYPE_STRING
    dims: [1]
  }
]

parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "$$TRITON_MODEL_DIRECTORY/seamlessm4t-large-v2.tar.gz"}
}

instance_group [{ kind: KIND_GPU }]
